blueskycoco/rt-thread/bsp/tm4c129x/libraries/usblib/device/usbdbulk.c
		if(i32Retcode!=-1)			
			rt_sem_take(&(psInst->tx_sem), RT_WAITING_FOREVER);
		else
			return -1;

	}
	else
	{
	
		//
		// Configure and DMA for the IN transfer.
		//	
		psInst->ui32Flags = USBD_FLAG_DMA_OUT;
		USBLibDMAChannelEnable(psInst->psDMAInstance,psInst->ui8INDMA);
		USBLibDMATransfer(psInst->psDMAInstance, psInst->ui8INDMA,pvBuffer, ui32Size);
		
		//
		// Remember that a DMA is in progress.
		//		
		rt_sem_take(&(psInst->tx_sem), RT_WAITING_FOREVER);
	}
	return 0;
}
int32_t USBBulkRx(void *pvBulkDevice,void *pvBuffer)
{
	int32_t ui32Size=0;
	tBulkInstance *psInst;
    tUSBDBulkDevice *psBulkDevice;
	rt_uint32_t temp =0;
	struct sBuffer *st;
	ASSERT(psBulkDevice != 0);
	
	ASSERT(pvBuffer);
	//
	// The audio device structure pointer.
	//
	psBulkDevice = (tUSBDBulkDevice *)pvBulkDevice;

	//
	// Create a pointer to the audio instance data.
	//
	psInst = &psBulkDevice->sPrivateData;
	if(rt_mb_recv(psInst->rx_pbuf_mb, &temp, RT_WAITING_FOREVER)==RT_EOK)
	{
		st=(struct sBuffer *)temp;
		pvBuffer=st->pvData;
		ui32Size=st->ui32Size;
		//rt_kprintf("new %x %d\n",pvBuffer,ui32Size);
	}
	
	#if 0
	//rt_kprintf("wait for rx_sem_begin\n");
	temp = rt_hw_interrupt_disable();
	if(wait_flag==0)
	{
		rt_hw_interrupt_enable(temp);
		rt_sem_take(&(psInst->rx_sem_begin), RT_WAITING_FOREVER);
	}
	else
		rt_hw_interrupt_enable(temp);

	ui32Size = USBEndpointDataAvail(psInst->ui32USBBase,psInst->ui8OUTEndpoint);
	//ui32Size=64;
	//rt_kprintf("to rcv begin %d\n",ui32Size);
	if(ui32Size>0)
	{
#if 0
		USBLibDMATransfer(psInst->psDMAInstance, psInst->ui8OUTDMA,(psInst->sBuffer.pvData+len), ui32Size);
		len+=ui32Size;
		len1+=ui32Size;
		psInst->ui32Flags=USBD_FLAG_DMA_IN;
		USBLibDMAChannelEnable(psInst->psDMAInstance,psInst->ui8OUTDMA);
		//rt_kprintf("get data %d outdma %d , endpoint %d\n",ui32Size,psInst->ui8OUTDMA,psInst->ui8OUTEndpoint);
#endif
		//*pvBuffer=rt_malloc(ui32Size);
		//rt_kprintf("debug 1\n");
		//
		// Configure the next DMA transfer.
		//	
		psInst->ui32Flags=USBD_FLAG_DMA_IN;
		USBLibDMATransfer(psInst->psDMAInstance, psInst->ui8OUTDMA,pvBuffer, ui32Size);
		//rt_kprintf("debug 2\n");
		//rt_kprintf("to start %d dma %d\n",*(int *)psBulkDevice->pvRxCBData,ui32Size);
		USBLibDMAChannelEnable(psInst->psDMAInstance,psInst->ui8OUTDMA);	
		//rt_kprintf("to rcv ...\n");
		rt_sem_take(&(psInst->rx_sem_done), RT_WAITING_FOREVER);
		temp = rt_hw_interrupt_disable();
		wait_flag=0;
		rt_hw_interrupt_enable(temp);
		//rt_kprintf("wait rx done %d\n",ui32Size);
	}
	#endif
	return ui32Size;
}
void USBBulkAckHost(void *pvBulkDevice)
{
	tBulkInstance *psInst;
    tUSBDBulkDevice *psBulkDevice;
	static int times=0;
	ASSERT(psBulkDevice != 0);
	// The audio device structure pointer.
	//
	psBulkDevice = (tUSBDBulkDevice *)pvBulkDevice;

	//
	// Create a pointer to the audio instance data.
	//
	psInst = &psBulkDevice->sPrivateData;
	rt_kprintf("release %d times\n",times++);
	//MAP_USBDevEndpointDataAck(USB0_BASE, psInst->ui8OUTEndpoint, 0);	
	psInst->ui32Flags=0;

}
//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
